10/data/attachments/6f7b9c7cd2a14e57.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Christopher_book_Friend_32938_4</nif:username>
            <nif:friendToBeRequested>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>